HELP_1 = """<b><u>𝐀ᴅᴍɪɴ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

𝐉ᴜꜱᴛ 𝐀ᴅᴅ <b>𝐂</b> ᴀᴛ ᴛʜᴇ 𝐁ᴇɢɪɴɴɪɴɢ ᴏꜰ 𝐂ᴏᴍᴍᴀɴᴅꜱ ᴛᴏ 𝐔ꜱᴇ 𝐓ʜᴇᴍ ꜰᴏʀ 𝐂ʜᴀɴɴᴇʟꜱ.

• /pause : 𝐏ᴀᴜꜱᴇꜱ ᴛʜᴇ 𝐂ᴜʀʀᴇɴᴛ 𝐏ʟᴀʏɪɴɢ 𝐒ᴛʀᴇᴀᴍ.  
• /resume : 𝐑ᴇꜱᴜᴍᴇꜱ ᴛʜᴇ 𝐏ᴀᴜꜱᴇᴅ 𝐒ᴛʀᴇᴀᴍ.  
• /skip : 𝐒ᴋɪᴘꜱ ᴛʜᴇ 𝐂ᴜʀʀᴇɴᴛ 𝐓ʀᴀᴄᴋ ᴀɴᴅ 𝐒ᴛᴀʀᴛꜱ ᴛʜᴇ 𝐍ᴇxᴛ 𝐎ɴᴇ.  
• /end ᴏʀ /stop : 𝐂ʟᴇᴀʀꜱ ᴛʜᴇ 𝐐ᴜᴇᴜᴇ ᴀɴᴅ 𝐒ᴛᴏᴘꜱ ᴛʜᴇ 𝐒ᴛʀᴇᴀᴍ.  
• /player : 𝐎ᴘᴇɴꜱ ᴀɴ 𝐈ɴᴛᴇʀᴀᴄᴛɪᴠᴇ 𝐏ʟᴀʏᴇʀ 𝐏ᴀɴᴇʟ.  
• /queue : 𝐒ʜᴏᴡꜱ ᴛʜᴇ 𝐐ᴜᴇᴜᴇᴅ 𝐓ʀᴀᴄᴋꜱ.
"""

HELP_2 = """<b><u>𝐀ᴜᴛʜ 𝐔ꜱᴇʀꜱ :</u></b>

𝐀ᴜᴛʜ 𝐔ꜱᴇʀꜱ 𝐂ᴀɴ 𝐔ꜱᴇ 𝐀ᴅᴍɪɴ 𝐂ᴏᴍᴍᴀɴᴅꜱ 𝐖ɪᴛʜᴏᴜᴛ 𝐇ᴀᴠɪɴɢ 𝐀ᴅᴍɪɴ 𝐑ɪɢʜᴛꜱ ɪɴ ᴛʜᴇ 𝐂ʜᴀᴛ.

• /auth [𝐔ꜱᴇʀɴᴀᴍᴇ/𝐈𝐃] : 𝐀ᴅᴅꜱ ᴀ 𝐔ꜱᴇʀ ᴛᴏ ᴛʜᴇ 𝐀ᴜᴛʜ 𝐋ɪꜱᴛ.  
• /unauth [𝐔ꜱᴇʀɴᴀᴍᴇ/𝐈𝐃] : 𝐑ᴇᴍᴏᴠᴇꜱ ᴀ 𝐔ꜱᴇʀ ꜰʀᴏᴍ ᴛʜᴇ 𝐀ᴜᴛʜ 𝐋ɪꜱᴛ.  
• /authusers : 𝐒ʜᴏᴡꜱ ᴛʜᴇ 𝐋ɪꜱᴛ ᴏꜰ 𝐀ᴜᴛʜᴏʀɪᴢᴇᴅ 𝐔ꜱᴇʀꜱ.
"""

HELP_3 = """<b><u>𝐁ʀᴏᴀᴅᴄᴀꜱᴛ 𝐅ᴇᴀᴛᴜʀᴇ :</u></b> [𝐒ᴜᴅᴏ 𝐎ɴʟʏ]

• /broadcast [𝐌ᴇꜱꜱᴀɢᴇ/𝐑ᴇᴘʟʏ] : 𝐒ᴇɴᴅꜱ ᴀ 𝐁ʀᴏᴀᴅᴄᴀꜱᴛ ᴛᴏ 𝐀ʟʟ 𝐒ᴇʀᴠᴇᴅ 𝐂ʜᴀᴛꜱ.

<b>𝐌ᴏᴅᴇꜱ :</b>  
- <b>-𝐏ɪɴ</b> : 𝐏ɪɴꜱ ᴛʜᴇ 𝐌ᴇꜱꜱᴀɢᴇ.  
- <b>-𝐏ɪɴʟᴏᴜᴅ</b> : 𝐏ɪɴꜱ ᴀɴᴅ 𝐒ᴇɴᴅꜱ 𝐍ᴏᴛɪꜰɪᴄᴀᴛɪᴏɴ.  
- <b>-𝐔ꜱᴇʀ</b> : 𝐒ᴇɴᴅꜱ ᴛᴏ 𝐔ꜱᴇʀꜱ 𝐖ʜᴏ 𝐒ᴛᴀʀᴛᴇᴅ ᴛʜᴇ 𝐁ᴏᴛ.  
- <b>-𝐀ꜱꜱɪꜱᴛᴀɴᴛ</b> : 𝐒ᴇɴᴅꜱ ꜰʀᴏᴍ ᴛʜᴇ 𝐀ꜱꜱɪꜱᴛᴀɴᴛ 𝐀ᴄᴄᴏᴜɴᴛ.  
- <b>-𝐍ᴏʙᴏᴛ</b> : 𝐃ɪꜱᴀʙʟᴇꜱ 𝐁ᴏᴛ 𝐒ᴇɴᴅɪɴɢ.

<b>𝐄xᴀᴍᴘʟᴇ :</b>  
<code>/broadcast -user -assistant -pin ᴛᴇsᴛɪɴɢ ʙʀᴏᴀᴅᴄᴀsᴛ</code>
"""

HELP_4 = """<b><u>𝐂ʜᴀᴛ 𝐁ʟᴀᴄᴋʟɪꜱᴛ :</u></b> [𝐒ᴜᴅᴏ 𝐎ɴʟʏ]

𝐑ᴇꜱᴛʀɪᴄᴛ 𝐀ʙᴜꜱɪᴠᴇ ᴏʀ 𝐒ᴘᴀᴍᴍʏ 𝐂ʜᴀᴛꜱ ꜰʀᴏᴍ 𝐔ꜱɪɴɢ ᴛʜᴇ 𝐁ᴏᴛ.

• /blacklistchat [𝐈𝐃] : 𝐁ʟᴀᴄᴋʟɪꜱᴛꜱ ᴀ 𝐂ʜᴀᴛ.  
• /whitelistchat [𝐈𝐃] : 𝐑ᴇᴍᴏᴠᴇꜱ ᴀ 𝐂ʜᴀᴛ ꜰʀᴏᴍ 𝐁ʟᴀᴄᴋʟɪꜱᴛ.  
• /blacklistedchat : 𝐒ʜᴏᴡꜱ 𝐀ʟʟ 𝐁ʟᴀᴄᴋʟɪꜱᴛᴇᴅ 𝐂ʜᴀᴛꜱ.
"""

HELP_5 = """<b><u>𝐁ʟᴏᴄᴋ 𝐔ꜱᴇʀꜱ :</u></b> [𝐒ᴜᴅᴏ 𝐎ɴʟʏ]

𝐁ʟᴏᴄᴋᴇᴅ 𝐔ꜱᴇʀꜱ 𝐂ᴀɴ’ᴛ 𝐔ꜱᴇ 𝐁ᴏᴛ 𝐂ᴏᴍᴍᴀɴᴅꜱ.

• /block [𝐔ꜱᴇʀ/𝐑ᴇᴘʟʏ] : 𝐁ʟᴏᴄᴋꜱ ᴀ 𝐔ꜱᴇʀ.  
• /unblock [𝐔ꜱᴇʀ/𝐑ᴇᴘʟʏ] : 𝐔ɴʙʟᴏᴄᴋꜱ ᴀ 𝐔ꜱᴇʀ.  
• /blockedusers : 𝐒ʜᴏᴡꜱ 𝐀ʟʟ 𝐁ʟᴏᴄᴋᴇᴅ 𝐔ꜱᴇʀꜱ.
"""

HELP_6 = """<b><u>𝐂ʜᴀɴɴᴇʟ 𝐏ʟᴀʏ :</u></b>

𝐒ᴛʀᴇᴀᴍ 𝐀ᴜᴅɪᴏ/𝐕ɪᴅᴇᴏ ɪɴ ᴀ 𝐂ʜᴀɴɴᴇʟ.

• /cplay : 𝐒ᴛᴀʀᴛ 𝐀ᴜᴅɪᴏ 𝐒ᴛʀᴇᴀᴍɪɴɢ.  
• /cvplay : 𝐒ᴛᴀʀᴛ 𝐕ɪᴅᴇᴏ 𝐒ᴛʀᴇᴀᴍɪɴɢ.  
• /cplayforce ᴏʀ /cvplayforce : 𝐅ᴏʀᴄᴇꜱ ᴀ 𝐍ᴇᴡ 𝐒ᴛʀᴇᴀᴍ.  
• /channelplay [𝐔ꜱᴇʀɴᴀᴍᴇ/𝐈𝐃] ᴏʀ [𝐃ɪꜱᴀʙʟᴇ] : 𝐋ɪɴᴋꜱ ᴀ 𝐂ʜᴀɴɴᴇʟ ᴡɪᴛʜ ᴀ 𝐆ʀᴏᴜᴘ.
"""

HELP_7 = """<b><u>𝐆ʟᴏʙᴀʟ 𝐁ᴀɴ :</u></b> [𝐒ᴜᴅᴏ 𝐎ɴʟʏ]

• /gban [𝐔ꜱᴇʀ/𝐑ᴇᴘʟʏ] : 𝐆ʟᴏʙᴀʟʟʏ 𝐁ᴀɴꜱ ᴀ 𝐔ꜱᴇʀ.  
• /ungban [𝐔ꜱᴇʀ/𝐑ᴇᴘʟʏ] : 𝐔ɴʙᴀɴꜱ ᴀ 𝐆ʟᴏʙᴀʟʟʏ 𝐁ᴀɴɴᴇᴅ 𝐔ꜱᴇʀ.  
• /gbannedusers : 𝐒ʜᴏᴡꜱ ᴛʜᴇ 𝐋ɪꜱᴛ ᴏꜰ 𝐆ʟᴏʙᴀʟʟʏ 𝐁ᴀɴɴᴇᴅ 𝐔ꜱᴇʀꜱ.
"""

HELP_8 = """<b><u>𝐋ᴏᴏᴘ 𝐒ᴛʀᴇᴀᴍ :</u></b>

𝐑ᴇᴘᴇᴀᴛ ᴛʜᴇ 𝐂ᴜʀʀᴇɴᴛ 𝐒ᴛʀᴇᴀᴍ.

• /loop [𝐄ɴᴀʙʟᴇ/𝐃ɪꜱᴀʙʟᴇ] : 𝐄ɴᴀʙʟᴇꜱ ᴏʀ 𝐃ɪꜱᴀʙʟᴇꜱ 𝐋ᴏᴏᴘ.  
• /loop [1–10] : 𝐒ᴇᴛꜱ 𝐋ᴏᴏᴘ 𝐂ᴏᴜɴᴛ.
"""

HELP_9 = """<b><u>𝐌ᴀɪɴᴛᴇɴᴀɴᴄᴇ :</u></b> [𝐒ᴜᴅᴏ 𝐎ɴʟʏ]

• /logs : 𝐆ᴇᴛꜱ 𝐁ᴏᴛ 𝐋ᴏɢꜱ.  
• /logger [𝐄ɴᴀʙʟᴇ/𝐃ɪꜱᴀʙʟᴇ] : 𝐓ᴏɢɢʟᴇꜱ 𝐀ᴄᴛɪᴠɪᴛʏ 𝐋ᴏɢɢɪɴɢ.  
• /maintenance [𝐄ɴᴀʙʟᴇ/𝐃ɪꜱᴀʙʟᴇ] : 𝐄ɴᴀʙʟᴇꜱ ᴏʀ 𝐃ɪꜱᴀʙʟᴇꜱ 𝐌ᴀɪɴᴛᴇɴᴀɴᴄᴇ 𝐌ᴏᴅᴇ.
"""

HELP_10 = """<b><u>𝐏ɪɴɢ & 𝐒ᴛᴀᴛꜱ :</u></b>

• /start : 𝐒ᴛᴀʀᴛꜱ ᴛʜᴇ 𝐁ᴏᴛ.  
• /help : 𝐒ʜᴏᴡꜱ ᴛʜᴇ 𝐇ᴇʟᴘ 𝐌ᴇɴᴜ.  
• /ping : 𝐒ʜᴏᴡꜱ 𝐁ᴏᴛ 𝐋ᴀᴛᴇɴᴄʏ ᴀɴᴅ 𝐒ʏꜱᴛᴇᴍ 𝐒ᴛᴀᴛꜱ.  
• /stats : 𝐒ʜᴏᴡꜱ 𝐎ᴠᴇʀᴀʟʟ 𝐁ᴏᴛ 𝐒ᴛᴀᴛɪꜱᴛɪᴄꜱ.
"""

HELP_11 = """<b><u>𝐏ʟᴀʏ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

<b>𝐕 :</b> 𝐕ɪᴅᴇᴏ 𝐏ʟᴀʏ  
<b>𝐅ᴏʀᴄᴇ :</b> 𝐅ᴏʀᴄᴇ 𝐏ʟᴀʏ  

• /play ᴏʀ /vplay : 𝐒ᴛᴀʀᴛꜱ 𝐀ᴜᴅɪᴏ/𝐕ɪᴅᴇᴏ 𝐒ᴛʀᴇᴀᴍɪɴɢ.  
• /playforce ᴏʀ /vplayforce : 𝐅ᴏʀᴄᴇꜱ ᴀ 𝐍ᴇᴡ 𝐒ᴛʀᴇᴀᴍ.
"""

HELP_12 = """<b><u>𝐒ʜᴜꜰꜰʟᴇ 𝐐ᴜᴇᴜᴇ :</u></b>

• /shuffle : 𝐒ʜᴜꜰꜰʟᴇꜱ ᴛʜᴇ 𝐐ᴜᴇᴜᴇ.  
• /queue : 𝐒ʜᴏᴡꜱ ᴛʜᴇ 𝐒ʜᴜꜰꜰʟᴇᴅ 𝐐ᴜᴇᴜᴇ.
"""

HELP_13 = """<b><u>𝐒ᴇᴇᴋ 𝐒ᴛʀᴇᴀᴍ :</u></b>

• /seek [𝐒ᴇᴄᴏɴᴅꜱ] : 𝐆ᴏᴇꜱ 𝐅ᴏʀᴡᴀʀᴅ ɪɴ ᴛʜᴇ 𝐒ᴛʀᴇᴀᴍ.  
• /seekback [𝐒ᴇᴄᴏɴᴅꜱ] : 𝐒ᴇᴇᴋꜱ 𝐁ᴀᴄᴋᴡᴀʀᴅ.
"""

HELP_14 = """<b><u>𝐒ᴏɴɢ 𝐃ᴏᴡɴʟᴏᴀᴅ :</u></b>

• /song [𝐍ᴀᴍᴇ/𝐘ᴛ 𝐔𝐑𝐋] : 𝐃ᴏᴡɴʟᴏᴀᴅꜱ ᴀ 𝐒ᴏɴɢ ɪɴ 𝐌ᴘ3 ᴏʀ 𝐌ᴘ4 𝐅ᴏʀᴍᴀᴛ.
"""

HELP_15 = """<b><u>𝐒ᴘᴇᴇᴅ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b> [𝐀ᴅᴍɪɴ 𝐎ɴʟʏ]

𝐂ᴏɴᴛʀᴏʟ ᴛʜᴇ 𝐏ʟᴀʏʙᴀᴄᴋ 𝐒ᴘᴇᴇᴅ ᴏꜰ ᴛʜᴇ 𝐒ᴛʀᴇᴀᴍ.

• /speed ᴏʀ /playback : 𝐀ᴅᴊᴜꜱᴛꜱ 𝐀ᴜᴅɪᴏ 𝐒ᴘᴇᴇᴅ ɪɴ 𝐆ʀᴏᴜᴘꜱ.  
• /cspeed ᴏʀ /cplayback : 𝐀ᴅᴊᴜꜱᴛꜱ 𝐀ᴜᴅɪᴏ 𝐒ᴘᴇᴇᴅ ɪɴ 𝐂ʜᴀɴɴᴇʟꜱ.
"""

HELP_16 = """<b><u>𝐂ʜ𝛂𝐍ɢᴇ 𝐋𝛂𝐍ɢᴜ𝛂𝐆ᴇ :</u></b>

• /lang : 𝐂ʜ𝛂𝐍ɢᴇ ᴛʜᴇ 𝐁ᴏᴛ 𝐋𝛂𝐍ɢᴜ𝛂𝐆ᴇ ᴛᴏ 𝐘ᴏᴜʀ 𝐏ʀᴇꜰᴇʀʀᴇᴅ 𝐋𝛂𝐍ɢᴜ𝛂𝐆ᴇ ꜰᴏʀ ᴀ 𝐌ᴏʀᴇ 𝐏ᴇʀꜱᴏɴ𝛂ℓ𝐈ᴢᴇᴅ 𝐄xᴘᴇʀɪᴇɴᴄᴇ.
"""

HELP_17 = """<b><u>𝐂ʜᴀᴛʙᴏᴛ :</u></b>

𝐀 𝐒ɪᴍᴘʟᴇ 𝐀ᴜᴛᴏ-𝐑ᴇᴘʟʏ 𝐂ʜᴀᴛʙᴏᴛ 𝐓ʜᴀᴛ 𝐋ᴇᴀʀɴꜱ ꜰʀᴏᴍ 𝐘ᴏᴜʀ 𝐆ʀᴏᴜᴘ, 𝐏ᴏᴡᴇʀᴇᴅ 𝐄ɴᴛɪʀᴇʟʏ ʙʏ 𝐌ᴏɴɢᴏᴅʙ. 𝐍ᴏ 𝐄xᴛᴇʀɴᴀʟ 𝐀𝐈 𝐀𝐏𝐈 ɪꜱ 𝐔ꜱᴇᴅ.

• <code>/chatbot on</code> — 𝐄ɴᴀʙʟᴇ 𝐀ᴜᴛᴏ-𝐑ᴇᴘʟɪᴇꜱ ɪɴ 𝐓ʜɪꜱ 𝐂ʜᴀᴛ
• <code>/chatbot off</code> — 𝐃ɪꜱᴀʙʟᴇ 𝐀ᴜᴛᴏ-𝐑ᴇᴘʟɪᴇꜱ ɪɴ 𝐓ʜɪꜱ 𝐂ʜᴀᴛ
"""
