# -----------------------------------------------
# 🔴 Azura ✘ Music Project
# 🔷️ Developed & Maintained by: 𝐌ʀ 𝐕ɪɴɴᴜ
# 📅 Copyright © 2026 – All Rights Reserved
#
# 📖 License:
# This source code is open for educational and non-commercial use ONLY.
# Commercial use, redistribution, or modification of this source
# without prior written permission from the author is prohibited.
#
# ❤️ Made with dedication & love by 𝐌ʀ 𝐕ɪɴɴᴜ
# -----------------------------------------------
from AZURAMUSIC import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " **❅ बेबी कहा हो। 🤗** ",
           " **❅ ओए सो गए क्या, ऑनलाइन आओ ।😊** ",
           " **❅ ओए वीसी आओ बात करते हैं । 😃** ",
           " **❅ खाना खाया कि नही। 🥲** ",
           " **❅ घर में सब कैसे हैं। 🥺** ",
           " **❅ पता है बहुत याद आ रही आपकी। 🤭** ",
           " **❅ और बताओ कैसे हो।..?? 🤨** ",
           " **❅ मेरी भी सैटिंग करवा दो प्लीज..?? 🙂** ",
           " **❅ आपका नाम क्या है।..?? 🥲** ",
           " **❅ नाश्ता हो गया..?? 😋** ",
           " **❅ मुझे अपने ग्रूप में ऐड कर लो। 😍** ",
           " **❅ आपका दोस्त आपको बुला रहा है। 😅** ",
           " **❅ मुझसे शादी करोगे ..?? 🤔** ",
           " **❅ सोने चले गए क्या 🙄** ",
           " **❅ अरे यार कोई AC चला दो 😕** ",
           " **❅ आप कहा से हो..?? 🙃** ",
           " **❅ हेलो जी नमस्ते 😛** ",
           " **❅ BABY क्या कर रही हो..? 🤔** ",
           " **❅ क्या आप मुझे जानते हो .? ☺️** ",
           " **❅ आओ baby Ludo खेलते है .🤗** ",
           " **❅ चलती है क्या 9 से 12... 😇** ",
           " **❅ आपके पापा क्या करते है 🤭** ",
           " **❅ आओ baby बाजार चलते है गोलगप्पे खाने। 🥺** ",
           " **❅ अकेली ना बाजार जाया करो, नज़र लग जायेगी। 😶** ",
           " **❅ और बताओ BF कैसा है ..?? 🤔** ",
           " **❅ गुड मॉर्निंग 😜** ",
           " **❅ मेरा एक काम करोगे। 🙂** ",
           " **❅ DJ वाले बाबू मेरा गाना चला दो। 😪** ",
           " **❅ आप से मिलकर अच्छा लगा।☺** ",
           " **❅ मेरे बाबू ने थाना थाया।..? 🙊** ",
           " **❅ पढ़ाई कैसी चल रही हैं ? 😺** ",
           " **❅ हम को प्यार हुआ। 🥲** ",
           " **❅ Nykaa कौन है...? 😅** ",
           " **❅ तू खींच मेरी फ़ोटो ..? 😅** ",
           " **❅ Phone काट मम्मी आ गई क्या। 😆** ",
           " **❅ और भाबी से कब मिल वा रहे हो । 😉** ",
           " **❅ क्या आप मुझसे प्यार करते हो 💚** ",
           " **❅ मैं तुम से बहुत प्यार करती हूं..? 👀** ",
           " **❅ बेबी एक kiss दो ना..?? 🙉** ",
           " **❅ एक जॉक सुनाऊं..? 😹** ",
           " **❅ vc पर आओ कुछ दिखाती हूं  😻** ",
           " **❅ क्या तुम instagram चलते हो..?? 🙃** ",
           " **❅ whatsapp नंबर दो ना अपना..? 😕** ",
           " **❅ आप की दोस्त से मेरी सेटिंग करा दो ..? 🙃** ",
           " **❅ सारा काम हो गया हो तो ऑनलाइन आ जाओ।..? 🙃** ",
           " **❅ कहा से हो आप 😊** ",
           " **❅ जा तुझे आज़ाद कर दिया मैंने मेरे दिल से। 🥺** ",
           " **❅ मेरा एक काम करोगे, ग्रूप मे कुछ मेंबर ऐड कर दो ..? ♥️** ",
           " **❅ मैं तुमसे नाराज़ हूं 😠** ",
           " **❅ आपकी फैमिली कैसी है..? ❤** ",
           " **❅ क्या हुआ..? 🤔** ",
           " **❅ बहुत याद आ रही है आपकी 😒** ",
           " **❅ भूल गए मुझे 😏** ",
           " **❅ झूठ क्यों बोला आपने मुझसे 🤐** ",
           " **❅ इतना भाव मत खाया करो, रोटी खाया करो कम से कम मोटी तो हो जाओगी 😒** ",
           " **❅ ये attitude किसे दिखा रहे हो 😮** ",
           " **❅ हेमलो कहा busy ho 👀** ",
           " **❅ आपके जैसा दोस्त पाकर मे बहुत खुश हूं। 🙈** ",
           " **❅ आज मन बहुत उदास है ☹️** ",
           " **❅ मुझसे भी बात कर लो ना 🥺** ",
           " **❅ आज खाने में क्या बनाया है 👀** ",
           " **❅ क्या चल रहा है 🙂** ",
           " **❅ message क्यों नहीं करती हो..🥺** ",
           " **❅ मैं मासूम हूं ना 🥺** ",
           " **❅ कल मज़ा आया था ना 😅** ",
           " **❅ कल कहा busy थे 😕** ",
           " **❅ आप relationship में हो क्या..? 👀** ",
           " **❅ कितने शांत रहते हो यार आप 😼** ",
           " **❅ आपको गाना, गाना आता है..? 😸** ",
           " **❅ घूमने चलोगे मेरे साथ..?? 🙈** ",
           " **❅ हमेशा हैप्पी रहा करो यार 🤞** ",
           " **❅ क्या हम दोस्त बन सकते है...? 🥰** ",
           " **❅ आप का विवाह हो गया क्या.. 🥺** ",
           " **❅ कहा busy the इतने दिनों से 🥲** ",
           " **❅ single हो या mingle 😉** ",
           " **❅ आओ पार्टी करते है 🥳** ",
           " **❅ Bio में link हैं join कर लो 🧐** ",
           " **❅ मैं तुमसे प्यार नहीं करती, 🥺** ",
           " **❅ यहां आ जाओ ना ( @zaxpk ) मस्ती करेंगे 🤭** ",
           " **❅ भूल जाओ मुझे,..? 😊** ",
           " **❅ अपना बना ले पिया, अपना बना ले 🥺** ",
           " **❅ मेरा ग्रुप भी join कर लो ना 🤗** ",
           " **❅ मैने तेरा नाम Dil rakh diya 😗** ",
           " **❅ तुमारे सारे दोस्त कहा गए 🥺** ",
           " **❅ my cute owner @vinnu_exe 🥰** ",
           " **❅ किसकी याद मे खोए हो जान 😜** ",
           " **❅ गुड नाईट जी बहुत रात हो गई 🥰** ",
           ]

VC_TAG = [ "**✨ 𝐈ꜰ 𝐘ᴏᴜ 𝐃ᴏ 𝐍ᴏᴛ 𝐒ᴛᴇᴘ 𝐅ᴏʀᴡᴀʀᴅ 𝐘ᴏᴜ 𝐖ɪʟʟ 𝐑ᴇᴍᴀɪɴ ɪɴ ᴛʜᴇ 𝐒ᴀᴍᴇ 𝐏ʟᴀᴄᴇ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐇ᴀʀᴅ 𝐁ᴜᴛ 𝐍ᴏᴛ 𝐈ᴍᴘᴏꜱꜱɪʙʟᴇ.**",
         "**✨ 𝐋ɪꜰᴇ’ꜱ 𝐓ᴏᴏ 𝐒ʜᴏʀᴛ ᴛᴏ 𝐀ʀɢᴜᴇ ᴀɴᴅ 𝐅ɪɢʜᴛ.**",
         "**✨ 𝐃ᴏɴ’ᴛ 𝐖ᴀɪᴛ ꜰᴏʀ ᴛʜᴇ 𝐏ᴇʀꜰᴇᴄᴛ 𝐌ᴏᴍᴇɴᴛ 𝐓ᴀᴋᴇ 𝐌ᴏᴍᴇɴᴛ ᴀɴᴅ 𝐌ᴀᴋᴇ ɪᴛ 𝐏ᴇʀꜰᴇᴄᴛ.**",
         "**✨ 𝐒ɪʟᴇɴᴄᴇ ɪꜱ ᴛʜᴇ 𝐁ᴇꜱᴛ 𝐀ɴꜱᴡᴇʀ ᴛᴏ 𝐒ᴏᴍᴇᴏɴᴇ 𝐖ʜᴏ 𝐃ᴏᴇꜱɴ’ᴛ 𝐕ᴀʟᴜᴇ 𝐘ᴏᴜʀ 𝐖ᴏʀᴅꜱ.**",
         "**✨ 𝐄ᴠᴇʀʏ 𝐍ᴇᴡ 𝐃ᴀʏ ɪꜱ ᴀ 𝐂ʜᴀɴᴄᴇ ᴛᴏ 𝐂ʜᴀɴɢᴇ 𝐘ᴏᴜʀ 𝐋ɪꜰᴇ.**",
         "**✨ 𝐓ᴏ 𝐂ʜᴀɴɢᴇ 𝐘ᴏᴜʀ 𝐋ɪꜰᴇ, 𝐘ᴏᴜ 𝐍ᴇᴇᴅ ᴛᴏ 𝐂ʜᴀɴɢᴇ 𝐘ᴏᴜʀ 𝐏ʀɪᴏʀɪᴛɪᴇꜱ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ ᴀ 𝐉ᴏᴜʀɴᴇʏ, 𝐍ᴏᴛ ᴀ 𝐑ᴀᴄᴇ..**",
         "**✨ 𝐒ᴍɪʟᴇ ᴀɴᴅ 𝐃ᴏɴ’ᴛ 𝐖ᴏʀʀʏ, 𝐋ɪꜰᴇ ɪꜱ 𝐀ᴡᴇꜱᴏᴍᴇ.**",
         "**✨ 𝐃ᴏ 𝐍ᴏᴛ 𝐂ᴏᴍᴘᴀʀᴇ 𝐘ᴏᴜʀꜱᴇʟꜰ ᴛᴏ 𝐎ᴛʜᴇʀꜱ ɪꜰ 𝐘ᴏᴜ 𝐃ᴏ ꜱᴏ 𝐘ᴏᴜ ᴀʀᴇ 𝐈ɴꜱᴜʟᴛɪɴɢ 𝐘ᴏᴜʀꜱᴇʟꜰ.**",
         "**✨ 𝐈 𝐀ᴍ ɪɴ ᴛʜᴇ 𝐏ʀᴏᴄᴇꜱꜱ ᴏꜰ 𝐁ᴇᴄᴏᴍɪɴɢ ᴛʜᴇ 𝐁ᴇꜱᴛ 𝐕ᴇʀꜱɪᴏɴ ᴏꜰ 𝐌ʏꜱᴇʟꜰ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐋ɪᴋᴇ 𝐈ᴄᴇ 𝐄ɴᴊᴏʏ ɪᴛ 𝐁ᴇꜰᴏʀᴇ ɪᴛ 𝐌ᴇʟᴛꜱ.**",
         "**✨ 𝐁ᴇ 𝐅ʀᴇᴇ 𝐋ɪᴋᴇ ᴀ 𝐁ɪʀᴅ.**",
         "**✨ 𝐍ᴏ 𝐎ɴᴇ ɪꜱ 𝐂ᴏᴍɪɴɢ ᴛᴏ 𝐒ᴀᴠᴇ 𝐘ᴏᴜ. 𝐓ʜɪꜱ 𝐋ɪꜰᴇ ᴏꜰ 𝐘ᴏᴜʀ ɪꜱ 100% 𝐘ᴏᴜʀ 𝐑ᴇꜱᴘᴏɴꜱɪʙɪʟɪᴛʏ..**",
         "**✨ 𝐋ɪꜰᴇ 𝐀ʟᴡᴀʏꜱ 𝐎ꜰꜰᴇʀꜱ 𝐘ᴏᴜ ᴀ 𝐒ᴇᴄᴏɴᴅ 𝐂ʜᴀɴᴄᴇ. 𝐈ᴛ’ꜱ 𝐂ᴀʟʟᴇᴅ 𝐓ᴏᴍᴏʀʀᴏᴡ.**",
         "**✨ 𝐋ɪꜰᴇ 𝐁ᴇɢɪɴꜱ ᴀᴛ ᴛʜᴇ 𝐄ɴᴅ ᴏꜰ 𝐘ᴏᴜʀ 𝐂ᴏᴍꜰᴏʀᴛ 𝐙ᴏɴᴇ.**",
         "**✨ 𝐀ʟʟ ᴛʜᴇ 𝐓ʜɪɴɢꜱ 𝐓ʜᴀᴛ 𝐇ᴜʀᴛ 𝐘ᴏᴜ, 𝐀ᴄᴛᴜᴀʟʟʏ 𝐓ᴇᴀᴄʜ 𝐘ᴏᴜ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐋ɪᴋᴇ ᴀ 𝐂ᴀᴍᴇʀᴀ. 𝐒ᴏ 𝐅ᴀᴄᴇ ɪᴛ ᴡɪᴛʜ ᴀ 𝐒ᴍɪʟᴇ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 10% ᴏꜰ 𝐖ʜᴀᴛ 𝐇ᴀᴘᴘᴇɴꜱ ᴛᴏ 𝐘ᴏᴜ ᴀɴᴅ 90% ᴏꜰ 𝐇ᴏᴡ 𝐘ᴏᴜ 𝐑ᴇꜱᴘᴏɴᴅ ᴛᴏ ɪᴛ.**",
         "**✨ 𝐋ɪꜰᴇ 𝐀ʟᴡᴀʏꜱ 𝐎ꜰꜰᴇʀꜱ 𝐘ᴏᴜ ᴀ 𝐒ᴇᴄᴏɴᴅ 𝐂ʜᴀɴᴄᴇ. 𝐈ᴛ’ꜱ 𝐂ᴀʟʟᴇᴅ 𝐓ᴏᴍᴏʀʀᴏᴡ.**",
         "**✨ 𝐍ᴏ 𝐎ɴᴇ ɪꜱ 𝐂ᴏᴍɪɴɢ ᴛᴏ 𝐒ᴀᴠᴇ 𝐘ᴏᴜ. 𝐓ʜɪꜱ 𝐋ɪꜰᴇ ᴏꜰ 𝐘ᴏᴜʀ ɪꜱ 100% 𝐘ᴏᴜʀ 𝐑ᴇꜱᴘᴏɴꜱɪʙɪʟɪᴛʏ..**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐍ᴏᴛ ᴀɴ 𝐄ᴀꜱʏ 𝐓ᴀꜱᴋ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ ᴀ 𝐖ᴏɴᴅᴇʀꜰᴜʟ 𝐀ᴅᴠᴇɴᴛᴜʀᴇ.**",
         "**✨ 𝐋ɪꜰᴇ 𝐁ᴇɢɪɴꜱ ᴏɴ ᴛʜᴇ 𝐎ᴛʜᴇʀ 𝐒ɪᴅᴇ ᴏꜰ 𝐃ᴇꜱᴘᴀɪʀ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐍ᴏᴛ ᴀ 𝐏ʀᴏʙʟᴇᴍ ᴛᴏ ʙᴇ 𝐒ᴏʟᴠᴇᴅ 𝐁ᴜᴛ ᴀ 𝐑ᴇᴀʟɪᴛʏ ᴛᴏ ʙᴇ 𝐄xᴘᴇʀɪᴇɴᴄᴇᴅ.**",
         "**✨ 𝐋ɪꜰᴇ 𝐃ᴏᴇꜱ 𝐍ᴏᴛ 𝐇ᴀᴠᴇ ᴀ 𝐑ᴇᴍᴏᴛᴇ; 𝐆ᴇᴛ 𝐔ᴘ ᴀɴᴅ 𝐂ʜᴀɴɢᴇ ɪᴛ 𝐘ᴏᴜʀꜱᴇʟꜰ.**",
         "**✨ 𝐒ᴛᴀʀᴛ 𝐓ʀᴜꜱᴛɪɴɢ 𝐘ᴏᴜʀꜱᴇʟꜰ, ᴀɴᴅ 𝐘ᴏᴜ’ʟʟ 𝐊ɴᴏᴡ 𝐇ᴏᴡ ᴛᴏ 𝐋ɪᴠᴇ.**",
         "**✨ 𝐇ᴇᴀʟᴛʜ ɪꜱ ᴛʜᴇ 𝐌ᴏꜱᴛ 𝐈ᴍᴘᴏʀᴛᴀɴᴛ 𝐆ᴏᴏᴅ ᴏꜰ 𝐋ɪꜰᴇ.**",
         "**✨ 𝐓ɪᴍᴇ 𝐂ʜᴀɴɢᴇ 𝐏ʀɪᴏʀɪᴛʏ 𝐂ʜᴀɴɢᴇꜱ.**",
         "**✨ 𝐓ᴏ 𝐒ᴇᴇ ᴀɴᴅ ᴛᴏ 𝐅ᴇᴇʟ 𝐌ᴇᴀɴꜱ ᴛᴏ ʙᴇ, 𝐓ʜɪɴᴋ ᴀɴᴅ 𝐋ɪᴠᴇ.**",
         "**✨ 𝐁ᴇ ᴡɪᴛʜ 𝐒ᴏᴍᴇᴏɴᴇ 𝐖ʜᴏ 𝐁ʀɪɴɢꜱ 𝐎ᴜᴛ ᴛʜᴇ 𝐁ᴇꜱᴛ ᴏꜰ 𝐘ᴏᴜ.**",
         "**✨ 𝐘ᴏᴜʀ 𝐓ʜᴏᴜɢʜᴛꜱ ᴀʀᴇ 𝐘ᴏᴜʀ 𝐋ɪꜰᴇ.**",
         "**✨ 𝐏ᴇᴏᴘʟᴇ 𝐂ʜᴀɴɢᴇ, 𝐌ᴇᴍᴏʀɪᴇꜱ 𝐃ᴏɴ’ᴛ.**",
         "**✨ 𝐎ᴜʀ 𝐋ɪꜰᴇ ɪꜱ 𝐖ʜᴀᴛ 𝐖ᴇ 𝐓ʜɪɴᴋ ɪᴛ ɪꜱ.**",
         "**✨ 𝐋ɪɢʜᴛ 𝐇ᴇᴀʀᴛ 𝐋ɪᴠᴇꜱ 𝐋ᴏɴɢᴇʀ.**",
         "**✨ 𝐃ᴇᴘʀᴇꜱꜱɪᴏɴ 𝐄ᴠᴇɴᴛᴜᴀʟʟʏ 𝐁ᴇᴄᴏᴍᴇꜱ ᴀ 𝐇ᴀʙɪᴛ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ ᴀ 𝐆ɪꜰᴛ. 𝐓ʀᴇᴀᴛ ɪᴛ 𝐖ᴇʟʟ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐖ʜᴀᴛ 𝐎ᴜʀ 𝐅ᴇᴇʟɪɴɢꜱ 𝐃ᴏ ᴡɪᴛʜ 𝐔ꜱ.**",
         "**✨ 𝐖ʀɪɴᴋʟᴇꜱ ᴀʀᴇ ᴛʜᴇ 𝐋ɪɴᴇꜱ ᴏꜰ 𝐋ɪꜰᴇ ᴏɴ ᴛʜᴇ 𝐅ᴀᴄᴇ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐌ᴀᴅᴇ 𝐔ᴘ ᴏꜰ 𝐒ᴏʙꜱ, 𝐒ɴɪꜰꜰʟᴇꜱ, ᴀɴᴅ 𝐒ᴍɪʟᴇꜱ.**",
         "**✨ 𝐍ᴏᴛ 𝐋ɪꜰᴇ, 𝐁ᴜᴛ 𝐆ᴏᴏᴅ 𝐋ɪꜰᴇ, ɪꜱ ᴛᴏ ʙᴇ 𝐂ʜɪᴇꜰʟʏ 𝐕ᴀʟᴜᴇᴅ.**",
         "**✨ 𝐘ᴏᴜ 𝐂ʜᴀɴɢᴇ 𝐘ᴏᴜʀ 𝐋ɪꜰᴇ ʙʏ 𝐂ʜᴀɴɢɪɴɢ 𝐘ᴏᴜʀ 𝐇ᴇᴀʀᴛ.",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐍ᴏᴛʜɪɴɢ 𝐖ɪᴛʜᴏᴜᴛ 𝐓ʀᴜᴇ 𝐅ʀɪᴇɴᴅꜱʜɪᴘ.**",
         "**✨ 𝐈ꜰ 𝐘ᴏᴜ ᴀʀᴇ 𝐁ʀᴀᴠᴇ ᴛᴏ 𝐒ᴀʏ 𝐆ᴏᴏᴅ 𝐁ʏᴇ, 𝐋ɪꜰᴇ 𝐖ɪʟʟ 𝐑ᴇᴡᴀʀᴅ 𝐘ᴏᴜ ᴡɪᴛʜ ᴀ 𝐍ᴇᴡ 𝐇ᴇʟʟᴏ.**",
         "**✨ 𝐓ʜᴇʀᴇ ɪꜱ 𝐍ᴏᴛʜɪɴɢ 𝐌ᴏʀᴇ 𝐄xᴄɪᴛɪɴɢ ɪɴ ᴛʜᴇ 𝐖ᴏʀʟᴅ, 𝐁ᴜᴛ 𝐏ᴇᴏᴘʟᴇ.**",
         "**✨ 𝐘ᴏᴜ 𝐂ᴀɴ 𝐃ᴏ 𝐀ɴʏᴛʜɪɴɢ, 𝐁ᴜᴛ 𝐍ᴏᴛ 𝐄ᴠᴇʀʏᴛʜɪɴɢ.**",
         "**✨ 𝐋ɪꜰᴇ 𝐁ᴇᴄᴏᴍᴇ 𝐄ᴀꜱʏ 𝐖ʜᴇɴ 𝐘ᴏᴜ 𝐁ᴇᴄᴏᴍᴇ 𝐒ᴛʀᴏɴɢ.**",
         "**✨ 𝐌ʏ 𝐋ɪꜰᴇ 𝐈ꜱɴ’ᴛ 𝐏ᴇʀꜰᴇᴄᴛ 𝐁ᴜᴛ ɪᴛ 𝐃ᴏᴇꜱ 𝐇ᴀᴠᴇ 𝐏ᴇʀꜰᴇᴄᴛ 𝐌ᴏᴍᴇɴᴛꜱ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐆ᴏᴅ’ꜱ 𝐍ᴏᴠᴇʟ. 𝐋ᴇᴛ 𝐇ɪᴍ 𝐖ʀɪᴛᴇ ɪᴛ.**",
         "**✨ 𝐎ᴜʀ 𝐋ɪꜰᴇ ɪꜱ ᴀ 𝐑ᴇꜱᴜʟᴛ ᴏꜰ 𝐎ᴜʀ 𝐃ᴏᴍɪɴᴀɴᴛ 𝐓ʜᴏᴜɢʜᴛꜱ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ ᴀ 𝐌ᴏᴛɪᴏɴ ꜰʀᴏᴍ ᴀ 𝐃ᴇꜱɪʀᴇ ᴛᴏ 𝐀ɴᴏᴛʜᴇʀ 𝐃ᴇꜱɪʀᴇ.**",
         "**✨ 𝐓ᴏ 𝐋ɪᴠᴇ 𝐌ᴇᴀɴꜱ ᴛᴏ 𝐅ɪɢʜᴛ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐋ɪᴋᴇ ᴀ 𝐌ᴏᴜɴᴛᴀɪɴ, 𝐍ᴏᴛ ᴀ 𝐁ᴇᴀᴄʜ.**",
         "**✨ 𝐓ʜᴇ 𝐖ᴏʀꜱᴛ 𝐓ʜɪɴɢ ɪɴ 𝐋ɪꜰᴇ ɪꜱ 𝐓ʜᴀᴛ ɪᴛ 𝐏ᴀꜱꜱᴇꜱ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐒ɪᴍᴘʟᴇ ɪꜰ 𝐖ᴇ ᴀʀᴇ 𝐒ɪᴍᴘʟᴇ.**",
         "**✨ 𝐀ʟᴡᴀʏꜱ 𝐓ʜɪɴᴋ 𝐓ᴡɪᴄᴇ, 𝐒ᴘᴇᴀᴋ 𝐎ɴᴄᴇ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐒ɪᴍᴘʟᴇ, 𝐖ᴇ 𝐌ᴀᴋᴇ ɪᴛ 𝐂ᴏᴍᴘʟɪᴄᴀᴛᴇᴅ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐍ᴏᴛ 𝐌ᴜᴄʜ 𝐎ʟᴅᴇʀ 𝐓ʜᴀɴ ᴛʜᴇ 𝐃ᴇᴀᴛʜ.**",
         "**✨ 𝐓ʜᴇ 𝐒ᴇᴄʀᴇᴛ ᴏꜰ 𝐋ɪꜰᴇ ɪꜱ 𝐋ᴏᴡ 𝐄xᴘᴇᴄᴛᴀᴛɪᴏɴꜱ!**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ ᴀ 𝐓ᴇᴀᴄʜᴇʀ..,ᴛʜᴇ 𝐌ᴏʀᴇ 𝐖ᴇ 𝐋ɪᴠᴇ, ᴛʜᴇ 𝐌ᴏʀᴇ 𝐖ᴇ 𝐋ᴇᴀʀɴ.**",
         "**✨ 𝐇ᴜᴍᴀɴ 𝐋ɪꜰᴇ ɪꜱ 𝐍ᴏᴛʜɪɴɢ 𝐁ᴜᴛ ᴀɴ 𝐄ᴛᴇʀɴᴀʟ 𝐈ʟʟᴜꜱɪᴏɴ.**",
         "**✨ 𝐓ʜᴇ 𝐇ᴀᴘᴘɪᴇʀ ᴛʜᴇ 𝐓ɪᴍᴇ, ᴛʜᴇ 𝐒ʜᴏʀᴛᴇʀ ɪᴛ ɪꜱ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐁ᴇᴀᴜᴛɪꜰᴜʟ ɪꜰ 𝐘ᴏᴜ  𝐊ɴᴏᴡ 𝐖ʜᴇʀᴇ ᴛᴏ 𝐋ᴏᴏᴋ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐀ᴡᴇꜱᴏᴍᴇ ᴡɪᴛʜ 𝐘ᴏᴜ ʙʏ 𝐌ʏ 𝐒ɪᴅᴇ.**",
         "**✨ 𝐋ɪꜰᴇ – 𝐋ᴏᴠᴇ = 𝐙ᴇʀᴏ**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐅ᴜʟʟ ᴏꜰ 𝐒ᴛʀᴜɢɢʟᴇꜱ.**",
         "**✨ 𝐈 𝐆ᴏᴛ 𝐋ᴇꜱꜱ 𝐁ᴜᴛ 𝐈 𝐆ᴏᴛ 𝐁ᴇꜱᴛ **",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 10% 𝐖ʜᴀᴛ 𝐘ᴏᴜ 𝐌ᴀᴋᴇ ɪᴛ, ᴀɴᴅ 90% 𝐇ᴏᴡ 𝐘ᴏᴜ 𝐓ᴀᴋᴇ ɪᴛ.**",
         "**✨ 𝐓ʜᴇʀᴇ ɪꜱ 𝐒ᴛɪʟʟ ꜱᴏ 𝐌ᴜᴄʜ ᴛᴏ 𝐒ᴇᴇ**",
         "**✨ 𝐋ɪꜰᴇ 𝐃ᴏᴇꜱɴ’ᴛ 𝐆ᴇᴛ 𝐄ᴀꜱɪᴇʀ 𝐘ᴏᴜ 𝐆ᴇᴛ 𝐒ᴛʀᴏɴɢᴇʀ.**",
         "**✨ 𝐋ɪꜰᴇ ɪꜱ 𝐀ʙᴏᴜᴛ 𝐋ᴀᴜɢʜɪɴɢ & 𝐋ɪᴠɪɴɢ.**",
         "**✨ 𝐄ᴀᴄʜ 𝐏ᴇʀꜱᴏɴ 𝐃ɪᴇꜱ 𝐖ʜᴇɴ 𝐇ɪꜱ 𝐓ɪᴍᴇ 𝐂ᴏᴍᴇꜱ.**",
        ]


@app.on_message(filters.command(["hitag" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ 𝐓ʜɪꜱ 𝐂ᴏᴍᴍᴀɴᴅ 𝐎ɴʟʏ ꜰᴏʀ 𝐆ʀᴏᴜᴘꜱ.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ 𝐘ᴏᴜ ᴀʀᴇ 𝐍ᴏᴛ 𝐀ᴅᴍɪɴ 𝐁ᴀʙʏ, 𝐎ɴʟʏ 𝐀ᴅᴍɪɴꜱ 𝐂ᴀɴ 𝐓ᴀɢ 𝐌ᴇᴍʙᴇʀꜱ. ")

    if message.reply_to_message and message.text:
        return await message.reply("/hitag 𝐆ᴏᴏᴅ 𝐌ᴏʀɴɪɴɢ 𝐓ʏᴘᴇ 𝐋ɪᴋᴇ 𝐓ʜɪꜱ / 𝐑ᴇᴘʟʏ 𝐀ɴʏ 𝐌ᴇꜱꜱᴀɢᴇ 𝐍ᴇxᴛ 𝐓ɪᴍᴇ 𝐁ᴏᴛ 𝐓ᴀɢɢɪɴɢ...")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/hitag 𝐆ᴏᴏᴅ 𝐌ᴏʀɴɪɴɢ 𝐓ʏᴘᴇ 𝐋ɪᴋᴇ 𝐓ʜɪꜱ / 𝐑ᴇᴘʟʏ 𝐀ɴʏ 𝐌ᴇꜱꜱᴀɢᴇ 𝐍ᴇxᴛ 𝐓ɪᴍᴇ 𝐅ᴏᴛ 𝐓ᴀɢɢɪɴɢ...")
    else:
        return await message.reply("/hitag 𝐆ᴏᴏᴅ 𝐌ᴏʀɴɪɴɢ 𝐓ʏᴘᴇ 𝐋ɪᴋᴇ 𝐓ʜɪꜱ / 𝐑ᴇᴘʟʏ 𝐀ɴʏ 𝐌ᴇꜱꜱᴀɢᴇ 𝐍ᴇxᴛ 𝐓ɪᴍᴇ 𝐁ᴏᴛ 𝐓ᴀɢɢɪɴɢ...")
    if chat_id in spam_chats:
        return await message.reply("๏ 𝐏ʟᴇᴀꜱᴇ ᴀᴛ 𝐅ɪʀꜱᴛ 𝐒ᴛᴏᴘ 𝐑ᴜɴɴɪɴɢ 𝐌ᴇɴᴛɪᴏɴ 𝐏ʀᴏᴄᴇꜱꜱ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](𝐓𝐆://𝐔ꜱᴇʀ?𝐈𝐃={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


@app.on_message(filters.command(["lifetag"], prefixes=["/", "@", "#"]))
async def mention_allvc(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ 𝐓ʜɪꜱ 𝐂ᴏᴍᴍᴀɴᴅ 𝐎ɴʟʏ ꜰᴏʀ 𝐆ʀᴏᴜᴘꜱ.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ 𝐘ᴏᴜ ᴀʀᴇ 𝐍ᴏᴛ 𝐀ᴅᴍɪɴ 𝐁ᴀʙʏ, 𝐎ɴʟʏ 𝐀ᴅᴍɪɴꜱ 𝐂ᴀɴ 𝐓ᴀɢ 𝐌ᴇᴍʙᴇʀꜱ. ")
    if chat_id in spam_chats:
        return await message.reply("๏ 𝐏ʟᴇᴀꜱᴇ ᴀᴛ 𝐅ɪʀꜱᴛ 𝐒ᴛᴏᴘ 𝐑ᴜɴɴɪɴɢ 𝐌ᴇɴᴛɪᴏɴ 𝐏ʀᴏᴄᴇꜱꜱ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            txt = f"{usrtxt} {random.choice(VC_TAG)}"
            await client.send_message(chat_id, txt)
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass



@app.on_message(filters.command(["hicancel", "histop", "lifestop"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("๏ 𝐂ᴜʀʀᴇɴᴛʟʏ 𝐈'ᴍ 𝐍ᴏᴛ 𝐓ᴀɢɢɪɴɢ 𝐁ᴀʙʏ.")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ 𝐘ᴏᴜ ᴀʀᴇ 𝐍ᴏᴛ 𝐀ᴅᴍɪɴ 𝐁ᴀʙʏ, 𝐎ɴʟʏ 𝐀ᴅᴍɪɴꜱ 𝐂ᴀɴ 𝐓ᴀɢ 𝐌ᴇᴍʙᴇʀꜱ.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("๏ 𝐌ᴇɴᴛɪᴏɴ 𝐏ʀᴏᴄᴇꜱꜱ 𝐒ᴛᴏᴘᴘᴇᴅ ๏")
