# -----------------------------------------------
# 🔴 Azura ✘ Music Project
# 🔷️ Developed & Maintained by: 𝐌ʀ 𝐕ɪɴɴᴜ
# 📅 Copyright © 2026 – All Rights Reserved
#
# 📖 License:
# This source code is open for educational and non-commercial use ONLY.
# Commercial use, redistribution, or modification of this source
# without prior written permission from the author is prohibited.
#
# ❤️ Made with dedication & love by 𝐌ʀ 𝐕ɪɴɴᴜ
# -----------------------------------------------

class Helper(object):
    HELP_M = '''<b>✦ 𝐂ʜᴏᴏꜱᴇ ᴛʜᴇ 𝐂ᴀᴛᴇɢᴏʀʏ ꜰᴏʀ 𝐖ʜɪᴄʜ 𝐘ᴏᴜ 𝐖ᴀɴɴᴀ 𝐆ᴇᴛ 𝐇ᴇʟᴘ.
𝐀ꜱᴋ 𝐘ᴏᴜʀ 𝐃ᴏᴜʙᴛꜱ ᴀᴛ 𝐒ᴜᴘᴘᴏʀᴛ 𝐂ʜᴀᴛ

✦ 𝐀ʟʟ 𝐂ᴏᴍᴍᴀɴᴅꜱ 𝐂ᴀɴ ʙᴇ 𝐔ꜱᴇᴅ ᴡɪᴛʜ : /</b>'''
    HELP_ChatGPT = '''<u><b>𝐂ʜᴀᴛɢᴘᴛ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

• /ask : 𝐐ᴜᴇʀɪᴇꜱ ᴛʜᴇ 𝐀𝐈 𝐌ᴏᴅᴇʟ ᴛᴏ 𝐆ᴇᴛ ᴀ 𝐑ᴇꜱᴘᴏɴꜱᴇ ᴛᴏ 𝐘ᴏᴜʀ 𝐐ᴜᴇꜱᴛɪᴏɴ.
• /chatgpt : 𝐀ꜱᴋ 𝐘ᴏᴜʀ 𝐐ᴜᴇꜱᴛɪᴏɴ ᴡɪᴛʜ 𝐀𝐈.
'''

    HELP_Sticker = '''<u><b>𝐒ᴛɪᴄᴋᴇʀꜱ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

• /packkang : 𝐂ʀᴇᴀᴛᴇꜱ ᴀ 𝐏ᴀᴄᴋ ᴏꜰ 𝐒ᴛɪᴄᴋᴇʀꜱ ꜰʀᴏᴍ ᴀ 𝐎ᴛʜᴇʀ 𝐏ᴀᴄᴋ.
• /stickerid : 𝐆ᴇᴛꜱ ᴛʜᴇ 𝐒ᴛɪᴄᴋᴇʀ 𝐈𝐃 ᴏꜰ ᴀ 𝐒ᴛɪᴄᴋᴇʀ.
'''

    HELP_TagAll = '''<u><b>𝐓ᴀɢ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

 𝐂ʜᴏᴏꜱᴇ 𝐓ᴀɢ ɪɴ 𝐘ᴏᴜʀ 𝐂ʜᴀᴛ 

• /gmtag : 𝐆ᴏᴏᴅ 𝐌ᴏʀɴɪɴɢ 
𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴ /gmstop

• /gntag : 𝐆ᴏᴏᴅ 𝐍ɪɢʜᴛ 𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴ /gnstop

• /tagall : 𝐑ᴀɴᴅᴏᴍ 𝐌ᴇꜱꜱᴀɢᴇ 𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴ /tagoff /tagstop

• /hitag : 𝐑ᴀɴᴅᴏᴍ 𝐇ɪɴᴅɪ 𝐌ᴇꜱꜱᴀɢᴇ 𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴/histop

• /shayari : 𝐑ᴀɴᴅᴏᴍ 𝐒ʜᴀʏᴀʀɪ 𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴ /shstop

• /utag : 𝐀ɴʏ 𝐖ʀɪᴛᴛᴇɴ 𝐓ᴇxᴛ 𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴ /cancel 

• /vctag : 𝐕ᴏɪᴄᴇ 𝐂ʜᴀᴛ 𝐈ɴᴠɪᴛᴇ 𝐓ᴀɢ 𝐒ᴛᴏᴘ ⇴ /vcstop
'''

    HELP_Info = '''<u><b>𝐈ɴꜰᴏ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

• /id : 𝐆ᴇᴛ ᴛʜᴇ 𝐂ᴜʀʀᴇɴᴛ 𝐆ʀᴏᴜᴘ 𝐈𝐃. 𝐈ꜰ 𝐔ꜱᴇᴅ ʙʏ 𝐑ᴇᴘʟʏɪɴɢ ᴛᴏ ᴀ 𝐌ᴇꜱꜱᴀɢᴇ, 𝐆ᴇᴛꜱ 𝐓ʜᴀᴛ 𝐔ꜱᴇʀ'ꜱ 𝐈𝐃.
• /info : 𝐆ᴇᴛ 𝐈ɴꜰᴏʀᴍᴀᴛɪᴏɴ 𝐀ʙᴏᴜᴛ ᴀ 𝐔ꜱᴇʀ.
• /github <𝐔ꜱᴇʀɴᴀᴍᴇ> : 𝐆ᴇᴛ 𝐈ɴꜰᴏʀᴍᴀᴛɪᴏɴ 𝐀ʙᴏᴜᴛ ᴀ 𝐆ɪᴛʜᴜʙ 𝐔ꜱᴇʀ.
'''
    HELP_Group = '''<u><b>𝐆ʀᴏᴜᴘ 𝐂ᴏᴍᴍᴀɴᴅꜱ:</u></b>

𝐓ʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ 𝐀ᴠᴀɪʟᴀʙʟᴇ 𝐆ʀᴏᴜᴘ 𝐌ᴀɴᴀɢᴇᴍᴇɴᴛ 𝐂ᴏᴍᴍᴀɴᴅꜱ :

• /pin : 𝐏ɪɴꜱ ᴀ 𝐌ᴇꜱꜱᴀɢᴇ ɪɴ ᴛʜᴇ 𝐆ʀᴏᴜᴘ.
• /pinned : 𝐃ɪꜱᴘʟᴀʏꜱ ᴛʜᴇ 𝐏ɪɴɴᴇᴅ 𝐌ᴇꜱꜱᴀɢᴇ ɪɴ ᴛʜᴇ 𝐆ʀᴏᴜᴘ.
• /unpin : 𝐔ɴᴘɪɴꜱ ᴛʜᴇ 𝐂ᴜʀʀᴇɴᴛʟʏ 𝐏ɪɴɴᴇᴅ 𝐌ᴇꜱꜱᴀɢᴇ.
• /staff : 𝐃ɪꜱᴘʟᴀʏꜱ ᴛʜᴇ 𝐋ɪꜱᴛ ᴏꜰ 𝐒ᴛᴀꜰꜰ 𝐌ᴇᴍʙᴇʀꜱ.
• /bots : 𝐃ɪꜱᴘʟᴀʏꜱ ᴛʜᴇ 𝐋ɪꜱᴛ ᴏꜰ 𝐁ᴏᴛꜱ ɪɴ ᴛʜᴇ 𝐆ʀᴏᴜᴘ.
• /settitle : 𝐒ᴇᴛꜱ ᴛʜᴇ 𝐓ɪᴛʟᴇ ᴏꜰ ᴛʜᴇ 𝐆ʀᴏᴜᴘ.
• /setdiscription : 𝐒ᴇᴛꜱ ᴛʜᴇ 𝐃ᴇꜱᴄʀɪᴘᴛɪᴏɴ ᴏꜰ ᴛʜᴇ 𝐆ʀᴏᴜᴘ.
• /setphoto : 𝐒ᴇᴛꜱ ᴛʜᴇ 𝐆ʀᴏᴜᴘ 𝐏ʜᴏᴛᴏ.
• /removephoto : 𝐑ᴇᴍᴏᴠᴇꜱ ᴛʜᴇ 𝐆ʀᴏᴜᴘ 𝐏ʜᴏᴛᴏ.
• /zombies : 𝐑ᴇᴍᴏᴠᴇꜱ 𝐀ᴄᴄ 𝐃ᴇʟᴇᴛᴇᴅ 𝐌ᴇᴍʙᴇʀꜱ ꜰʀᴏᴍ ᴛʜᴇ 𝐆ʀᴏᴜᴘ.
• /imposter ᴏɴ/𝐎ꜰꜰ : 𝐓ᴜʀɴꜱ ᴏɴ ᴏʀ 𝐎ꜰꜰ ᴛʜᴇ 𝐖ᴀᴛᴄʜᴇʀ ꜰᴏʀ 𝐘ᴏᴜʀ 𝐆ʀᴏᴜᴘ, 𝐖ʜɪᴄʜ 𝐍ᴏᴛɪꜰɪᴇꜱ 𝐀ʙᴏᴜᴛ 𝐔ꜱᴇʀꜱ 𝐖ʜᴏ 𝐂ʜᴀɴɢᴇ 𝐓ʜᴇɪʀ 𝐍ᴀᴍᴇ ᴏʀ 𝐔ꜱᴇʀɴᴀᴍᴇ.
'''

    HELP_Extra = '''<u><b>𝐄xᴛʀᴀ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

• /math : 𝐒ᴏʟᴠᴇꜱ 𝐌ᴀᴛʜᴇᴍᴀᴛɪᴄᴀʟ 𝐏ʀᴏʙʟᴇᴍꜱ ᴀɴᴅ 𝐄ǫᴜᴀᴛɪᴏɴꜱ.
• /blackpink : 𝐆ᴇɴᴇʀᴀᴛᴇꜱ ᴀ 𝐁ʟᴀᴄᴋᴘɪɴᴋ-𝐒ᴛʏʟᴇ 𝐋ᴏɢᴏ.
• /carbon : 𝐆ᴇɴᴇʀᴀᴛᴇꜱ ᴀ 𝐂ᴀʀʙᴏɴ 𝐂ᴏᴅᴇ 𝐈ᴍᴀɢᴇ ꜰʀᴏᴍ ᴀ 𝐂ᴏᴅᴇ 𝐒ɴɪᴘᴘᴇᴛ.
• /speedtest : 𝐌ᴇᴀꜱᴜʀᴇꜱ ᴛʜᴇ 𝐈ɴᴛᴇʀɴᴇᴛ 𝐒ᴘᴇᴇᴅ.
• /reverse : 𝐑ᴇᴠᴇʀꜱᴇꜱ ᴀ 𝐆ɪᴠᴇɴ 𝐓ᴇxᴛ.
• /webss : 𝐓ᴀᴋᴇꜱ ᴀ 𝐒ᴄʀᴇᴇɴꜱʜᴏᴛ ᴏꜰ ᴀ 𝐖ᴇʙꜱɪᴛᴇ.
• /paste : 𝐔ᴘʟᴏᴀᴅꜱ ᴀ 𝐓ᴇxᴛ 𝐒ɴɪᴘᴘᴇᴛ ᴛᴏ ᴛʜᴇ 𝐂ʟᴏᴜᴅ ᴀɴᴅ 𝐆ɪᴠᴇꜱ ᴀ 𝐋ɪɴᴋ.
• /tgm : 𝐔ᴘʟᴏᴀᴅꜱ ᴀ 𝐏ʜᴏᴛᴏ (𝐔ɴᴅᴇʀ 𝟻𝐌ʙ) ᴛᴏ ᴛʜᴇ 𝐂ʟᴏᴜᴅ ᴀɴᴅ 𝐆ɪᴠᴇꜱ ᴀ 𝐋ɪɴᴋ.
• /tr : 𝐓ʀᴀɴꜱʟᴀᴛᴇꜱ 𝐓ᴇxᴛ.
• /google : 𝐒ᴇᴀʀᴄʜᴇꜱ ꜰᴏʀ 𝐈ɴꜰᴏʀᴍᴀᴛɪᴏɴ ᴏɴ 𝐆ᴏᴏɢʟᴇ.
• /stack : 𝐒ᴇᴀʀᴄʜᴇꜱ ꜰᴏʀ 𝐏ʀᴏɢʀᴀᴍᴍɪɴɢ-𝐑ᴇʟᴀᴛᴇᴅ 𝐈ɴꜰᴏʀᴍᴀᴛɪᴏɴ ᴏɴ 𝐒ᴛᴀᴄᴋ 𝐎ᴠᴇʀꜰʟᴏᴡ.
'''

    HELP_Image = '''<u><b>𝐈ᴍᴀɢᴇ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

• /draw : 𝐆ᴇɴᴇʀᴀᴛᴇꜱ ᴀ 𝐃ʀᴀᴡɪɴɢ 𝐁ᴀꜱᴇᴅ ᴏɴ ᴀ 𝐆ɪᴠᴇɴ 𝐏ᴏʀᴏᴍᴘᴛ.
• /image : 𝐒ᴇᴀʀᴄʜᴇꜱ ꜰᴏʀ ᴀɴ 𝐈ᴍᴀɢᴇ 𝐁ᴀꜱᴇᴅ ᴏɴ ᴀ 𝐆ɪᴠᴇɴ 𝐊ᴇʏᴡᴏʀᴅ.
• /upscale : 𝐑ᴇᴘʟʏ ᴛᴏ ᴀɴ 𝐈ᴍᴀɢᴇ ᴛᴏ 𝐔ᴘꜱᴄᴀʟᴇ ɪᴛ ᴀɴᴅ 𝐈ᴍᴘʀᴏᴠᴇ 𝐈ᴛꜱ 𝐐ᴜᴀʟɪᴛʏ.
'''
    HELP_Action = '''<u><b>𝐀ᴄᴛɪᴏɴ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

 𝐀ᴠᴀɪʟᴀʙʟᴇ 𝐂ᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ 𝐁ᴀɴꜱ & 𝐌ᴜᴛᴇ :

 • /kickme : 𝐊ɪᴄᴋꜱ ᴛʜᴇ 𝐔ꜱᴇʀ 𝐖ʜᴏ 𝐈ꜱꜱᴜᴇᴅ ᴛʜᴇ 𝐂ᴏᴍᴍᴀɴᴅ

𝐀ᴅᴍɪɴꜱ 𝐎ɴʟʏ :
 • /ban <userhandle> : 𝐁ᴀɴꜱ ᴀ 𝐔ꜱᴇʀ. (𝐕ɪᴀ 𝐇ᴀɴᴅʟᴇ, ᴏʀ 𝐑ᴇᴘʟʏ)
 • /sban <userhandle> : 𝐒ɪʟᴇɴᴛʟʏ 𝐁ᴀɴ ᴀ 𝐔ꜱᴇʀ. 𝐃ᴇʟᴇᴛᴇꜱ 𝐂ᴏᴍᴍᴀɴᴅ, 𝐑ᴇᴘʟɪᴇᴅ 𝐌ᴇꜱꜱᴀɢᴇ ᴀɴᴅ 𝐃ᴏᴇꜱɴ'ᴛ 𝐑ᴇᴘʟʏ. (𝐕ɪᴀ 𝐇ᴀɴᴅʟᴇ, ᴏʀ 𝐑ᴇᴘʟʏ)
 • /tban <userhandle> 𝐗(𝐌/𝐇/𝐃) : 𝐁ᴀɴꜱ ᴀ 𝐔ꜱᴇʀ ꜰᴏʀ 𝐗 𝐓ɪᴍᴇ. (𝐕ɪᴀ 𝐇ᴀɴᴅʟᴇ, ᴏʀ 𝐑ᴇᴘʟʏ). 𝐌 = 𝐌ɪɴᴜᴛᴇꜱ, 𝐇 = 𝐇ᴏᴜʀꜱ, 𝐃 = 𝐃ᴀʏꜱ.
 • /unban <userhandle> : 𝐔ɴʙᴀɴꜱ ᴀ 𝐔ꜱᴇʀ. (𝐕ɪᴀ 𝐇ᴀɴᴅʟᴇ, ᴏʀ 𝐑ᴇᴘʟʏ)
 • /kick <userhandle> : 𝐊ɪᴄᴋꜱ ᴀ 𝐔ꜱᴇʀ 𝐎ᴜᴛ ᴏꜰ ᴛʜᴇ 𝐆ʀᴏᴜᴘ, (ᴠɪᴀ 𝐇ᴀɴᴅʟᴇ, ᴏʀ 𝐑ᴇᴘʟʏ)
 • /mute <userhandle> : 𝐒ɪʟᴇɴᴄᴇꜱ ᴀ 𝐔ꜱᴇʀ. 𝐂ᴀɴ 𝐀ʟꜱᴏ ʙᴇ 𝐔ꜱᴇᴅ ᴀꜱ ᴀ 𝐑ᴇᴘʟʏ, 𝐌ᴜᴛɪɴɢ ᴛʜᴇ 𝐑ᴇᴘʟɪᴇᴅ ᴛᴏ 𝐔ꜱᴇʀ.
 • /tmute <userhandle> 𝐗(𝐌/𝐇/𝐃) : 𝐌ᴜᴛᴇꜱ ᴀ 𝐔ꜱᴇʀ ꜰᴏʀ 𝐗 𝐓ɪᴍᴇ. (𝐕ɪᴀ 𝐇ᴀɴᴅʟᴇ, ᴏʀ 𝐑ᴇᴘʟʏ). 𝐌 = 𝐌ɪɴᴜᴛᴇꜱ, 𝐇 = 𝐇ᴏᴜʀꜱ, 𝐃 = 𝐃ᴀʏꜱ.
 • /unmute <userhandle> : 𝐔ɴᴍᴜᴛᴇꜱ ᴀ 𝐔ꜱᴇʀ. 𝐂ᴀɴ 𝐀ʟꜱᴏ ʙᴇ 𝐔ꜱᴇᴅ ᴀꜱ ᴀ 𝐑ᴇᴘʟʏ, 𝐌ᴜᴛɪɴɢ ᴛʜᴇ 𝐑ᴇᴘʟɪᴇᴅ ᴛᴏ 𝐔ꜱᴇʀ.
__
<b>𝐒ᴘᴇᴄɪᴀʟ 𝐂ᴏᴍᴍᴀɴᴅꜱ 𝐒ᴜᴘᴘᴏʀᴛ 𝐀ʟʟ 𝐄xᴀᴍᴘʟᴇ  - 𝐁ᴀʙʏ 𝐁ᴀɴ 𝐁ᴀʙᴜ 𝐌ᴜᴛᴇ 𝐒ᴀᴘɴᴀ 𝐏ʀᴏᴍᴏᴛᴇ ..... 𝐄ᴛᴄ</b>
'''
    HELP_Search = '''<u><b>𝐒ᴇᴀʀᴄʜ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

• /google <query> : 𝐒ᴇᴀʀᴄʜ ᴛʜᴇ 𝐆ᴏᴏɢʟᴇ ꜰᴏʀ ᴛʜᴇ 𝐆ɪᴠᴇɴ 𝐐ᴜᴇʀʏ.
• /anime <query>  : 𝐒ᴇᴀʀᴄʜ 𝐌ʏᴀɴɪᴍᴇʟɪꜱᴛ ꜰᴏʀ ᴛʜᴇ 𝐆ɪᴠᴇɴ 𝐐ᴜᴇʀʏ.
• /stack <query>  : 𝐒ᴇᴀʀᴄʜ 𝐒ᴛᴀᴄᴋᴏᴠᴇʀꜰʟᴏᴡ ꜰᴏʀ ᴛʜᴇ 𝐆ɪᴠᴇɴ 𝐐ᴜᴇʀʏ.
• /image (/imgs) <query> : 𝐆ᴇᴛ ᴛʜᴇ 𝐈ᴍᴀɢᴇꜱ 𝐑ᴇɢᴀʀᴅɪɴɢ ᴛᴏ 𝐘ᴏᴜʀ 𝐐ᴜᴇʀʏ

𝐄xᴀᴍᴘʟᴇ:
/google 𝐏ʏʀᴏɢʀᴀᴍ: 𝐑ᴇᴛᴜʀɴ 𝐓ᴏᴘ 5 𝐑ᴇᴜꜱʟᴛꜱ.
'''

    HELP_Font = '''<b><u>𝐅ᴏɴᴛ 𝐄ᴅɪᴛɪɴɢ 𝐂ᴍᴅꜱ :</b></u>

𝐁ʏ 𝐔ꜱɪɴɢ 𝐓ʜɪꜱ 𝐌ᴏᴅᴜʟᴇ 𝐘ᴏᴜ 𝐂ᴀɴ 𝐂ʜᴀɴɢᴇ 𝐅ᴏɴᴛꜱ ᴏꜰ 𝐀ɴʏ 𝐓ᴇxᴛ!

• /font [𝐓ᴇxᴛ]
• /fonts [𝐓ᴇxᴛ]
'''
    HELP_Game = '''<u><b>𝐆ᴀᴍᴇꜱ 𝐂ᴏᴍᴍᴀɴᴅꜱ : </u></b>
    
𝐇ᴇʀᴇ ᴀʀᴇ 𝐒ᴏᴍᴇ 𝐌ɪɴɪ 𝐆ᴀᴍᴇꜱ ꜰᴏʀ 𝐘ᴏᴜ ᴛᴏ 𝐏ʟᴀʏ!

• /toss [𝐓ᴏꜱꜱ ᴀ 𝐂ᴏɪɴ]

• /roll [𝐑ᴏʟʟ ᴀ 𝐃ɪᴄᴇ]

• /dart [𝐓ʜʀᴏᴡ ᴀ 𝐃ᴀʀᴛ]

• /slot [𝐉ᴀᴄᴋᴘᴏᴛ 𝐌ᴀᴄʜɪɴᴇ]

• /bowling [𝐁ᴏᴡʟɪɴɢ 𝐆ᴀᴍᴇ]

• /basket [𝐁ᴀꜱᴋᴇᴛʙᴀʟʟ 𝐆ᴀᴍᴇ]

• /football [𝐅ᴏᴏᴛʙᴀʟʟ 𝐆ᴀᴍᴇ]
'''
    HELP_TG = '''<u><b>

Ⓣ-𝐆ʀᴀᴘʜ 𝐂ᴏᴍᴍᴀɴᴅꜱ:</u></b>

𝐂ʀᴇᴀᴛᴇ ᴀ 𝐓ᴇʟᴇɢʀᴀᴘʜ 𝐋ɪɴᴋ 𝐀ɴʏ 𝐌ᴇᴅɪᴀ!

• /tgm [𝐑ᴇᴘʟʏ ᴛᴏ 𝐀ɴʏ 𝐌ᴇᴅɪᴀ]
• /tgt [𝐑ᴇᴘʟʏ ᴛᴏ 𝐀ɴʏ 𝐌ᴇᴅɪᴀ]
'''
    HELP_Imposter = '''<u><b>𝐈ᴍᴘᴏꜱᴛᴇʀ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

𝐇ᴇʀᴇ ɪꜱ ᴛʜᴇ 𝐇ᴇʟᴘ ꜰᴏʀ ᴛʜᴇ 𝐈ᴍᴘᴏꜱᴛᴇʀ 𝐌ᴏᴅᴜʟᴇ:

𝐈ᴍᴘᴏꜱᴛᴇʀ 𝐌ᴏᴅᴜʟᴇ:

• /imposter ᴏɴ
• /imposter 𝐎ꜰꜰ
'''
    HELP_TD = '''<u><b>𝐓ʀᴜᴛʜ-𝐃ᴀʀᴇ 𝐂ᴏᴍᴍᴀɴᴅ :</u></b>

𝐇ᴇʀᴇ ɪꜱ ᴛʜᴇ 𝐇ᴇʟᴘ ꜰᴏʀ ᴛʜᴇ 𝐓ʀᴜᴛʜ-𝐃ᴀʀᴇ 𝐌ᴏᴅᴜʟᴇ:

𝐓ʀᴜᴛʜ ᴀɴᴅ 𝐃ᴀʀᴇ
• /truth : 𝐒ᴇɴᴅꜱ ᴀ 𝐑ᴀɴᴅᴏᴍ 𝐓ʀᴜᴛʜ 𝐒ᴛʀɪɴɢ.
• /dare : 𝐒ᴇɴᴅꜱ ᴀ 𝐑ᴀɴᴅᴏᴍ 𝐃ᴀʀᴇ 𝐒ᴛʀɪɴɢ.
'''
    HELP_HT = '''<u><b>𝐇ᴀꜱᴛᴀɢ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

𝐇ᴇʀᴇ ɪꜱ ᴛʜᴇ 𝐇ᴇʟᴘ ꜰᴏʀ ᴛʜᴇ 𝐇ᴀꜱᴛᴀɢ 𝐌ᴏᴅᴜʟᴇ:

𝐇ᴀꜱᴛᴀɢ
• /hastag : [𝐓ᴇxᴛ]
'''
    HELP_TTS = '''<u><b>𝐓ᴇxᴛ ᴛᴏ 𝐒ᴘᴇᴇᴄʜ 𝐂ᴏᴍᴍᴀɴᴅꜱ:</u></b>

𝐇ᴇʀᴇ ɪꜱ ᴛʜᴇ 𝐇ᴇʟᴘ ꜰᴏʀ ᴛʜᴇ 𝐓ᴛꜱ 𝐌ᴏᴅᴜʟᴇ:

• /tts : [𝐓ᴇxᴛ]

• 𝐔ꜱᴀɢᴇ ➛ 𝐓ᴇxᴛ ᴛᴏ 𝐀ᴜᴅɪᴏ
'''
    HELP_Fun = '''<u><b>𝐅ᴜɴ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

𝐇ᴇʀᴇ ɪꜱ ᴛʜᴇ 𝐇ᴇʟᴘ ꜰᴏʀ ᴛʜᴇ 𝐅ᴜɴ 𝐌ᴏᴅᴜʟᴇ:
𝐖ɪꜱʜ 𝐌ᴏᴅᴜʟᴇ:

• /wish : 𝐀ᴅᴅ 𝐘ᴏᴜʀ 𝐖ɪꜱʜ ᴀɴᴅ 𝐒ᴇᴇ 𝐈ᴛꜱ 𝐏ᴏꜱꜱɪʙɪʟɪᴛʏ!

𝐌ᴏʀᴇ 𝐒ᴛᴜꜰꜰ:
• /sigma [𝐂ʜᴇᴄᴋ 𝐘ᴏᴜʀ 𝐒ɪɢᴍᴀɴᴇꜱꜱ]
• /cute [𝐂ʜᴇᴄᴋ 𝐘ᴏᴜʀ 𝐂ᴜᴛᴇɴᴇꜱꜱ]
• /horny [𝐂ʜᴇᴄᴋ 𝐘ᴏᴜʀ 𝐇ᴏʀɴʏɴᴇꜱꜱ]
• /lesbo [𝐂ʜᴇᴄᴋ 𝐇ᴏᴡ 𝐌ᴜᴄʜ 𝐋ᴇᴢʙɪᴀɴ 𝐘ᴏᴜ ᴀʀᴇ]
• /depressed [𝐂ʜᴇᴄᴋ 𝐇ᴏᴡ 𝐌ᴜᴄʜ 𝐃ᴇᴘʀᴇꜱꜱᴇᴅ 𝐘ᴏᴜ ᴀʀᴇ]
• /gay [𝐂ʜᴇᴄᴋ 𝐇ᴏᴡ 𝐌ᴜᴄʜ 𝐆ᴀʏ 𝐘ᴏᴜ ᴀʀᴇ]
• /rand [𝐂ʜᴇᴄᴋ 𝐇ᴏᴡ 𝐌ᴜᴄʜ 𝐑ᴀɴᴅ 𝐘ᴏᴜ ᴀʀᴇ]
• /bkl [𝐂ʜᴇᴄᴋ 𝐇ᴏᴡ 𝐌ᴜᴄʜ 𝐁ᴋʟ 𝐘ᴏᴜ ᴀʀᴇ]
• /boobs [𝐂ʜᴇᴄᴋ 𝐘ᴏᴜʀ 𝐁ᴏᴏʙɪᴇꜱ 𝐒ɪᴢᴇ]
• /dick [𝐂ʜᴇᴄᴋ 𝐘ᴏᴜʀ 𝐃ɪᴄᴋ 𝐒ɪᴢᴇ]
'''
    HELP_Q = '''<u><b>𝐐ᴜᴏᴛʟʏ 𝐂ᴏᴍᴍᴀɴᴅꜱ :</u></b>

𝐇ᴇʀᴇ ɪꜱ ᴛʜᴇ 𝐇ᴇʟᴘ ꜰᴏʀ ᴛʜᴇ 𝐐ᴜᴏᴛʟʏ 𝐌ᴏᴅᴜʟᴇ:

• /q : 𝐂ʀᴇᴀᴛᴇ ᴀ 𝐐ᴜᴏᴛᴇ ꜰʀᴏᴍ ᴛʜᴇ 𝐌ᴇꜱꜱᴀɢᴇ

• /q 𝐑 : 𝐂ʀᴇᴀᴛᴇ ᴀ 𝐐ᴜᴏᴛᴇ ꜰʀᴏᴍ ᴛʜᴇ 𝐌ᴇꜱꜱᴀɢᴇ ᴡɪᴛʜ 𝐑ᴇᴘʟʏ
'''
    
    
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
}

    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
}
